old_projects/Kelvin_Gelmgoltz_padaet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          550;
        startFace       175290;
    }
    movingWall1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          550;
        startFace       175840;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       176390;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       176470;
    }
    right1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       176550;
    }
    left1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       176630;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          176000;
        startFace       176710;
    }
)

// ************************************************************************* //
