old_projects/Kelvin_Gelmgoltz_padaet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water saltwater);

water
{
    transportModel  Newtonian;
    nu              1e-05;//1e-06
    rho             1000;
}

saltwater
{
    transportModel  Newtonian;
    nu              1e-05;
    rho             1026;//1026
}

sigma           0.05;


// ************************************************************************* //
